Revit 2026 API

# AdvancedGlazingGlazingF0 Property

---

The property labeled "Reflective Color" from the "AdvancedGlazing" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string GlazingF0 { get; }
```
```vb
Public Shared ReadOnly Property GlazingF0 As String
	Get
```
```cpp
public:
static property String^ GlazingF0 {
	String^ get ();
}
```
```fsharp
static member GlazingF0 : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.

#### Reference

AdvancedGlazing Class

Autodesk.Revit.DB.Visual Namespace